# Day_01_04_loop.py

# 1 3 5 7 9     1, 9, 2
# 0 1 2 3 4     0, 4, 1
# 4 3 2 1 0     4, 0, -1

i = 1           # 시작
while i <= 9:   # 종료
    print('hello', i)
    i = i+2     # 증감

i = 0
while i <= 4:
    print(i)
    i += 1

i = 0
while i < 5:
    print(i)
    i += 1

i = 4
while i >= 0:
    print(i)
    i -= 1

i = 4
while i >= 0:
    print(i)
    if i == 2:
        break
    i -= 1
print('-'*50)

# --------------------------------- #

for i in range(5):          # 시작(0), 종료, 증감(1)
    print(i, end=' ')
print()

for i in range(0, 5):       # 시작, 종료, 증감(1)
    print(i, end=' ')
print()

for i in range(0, 5, 1):    # 시작, 종료, 증감
    print(i, end=' ')
print()

# 문제
# 0~99까지 정수를 한 줄에 10개씩 출력하는 함수를 만드세요.
def show100():
    for i in range(100):
        print(i, end=' ')

        if i%10 == 9:
            print()

show100()

# 0 1 2 3 4 5 6 7 8 9
# 10 11 12 13 14 15 16 17 18 19
# 20 21 22 23 24 25 26 27 28 29
# 30 31 32 33 34 35 36 37 38 39
# 40 41 42 43 44 45 46 47 48 49
# 50 51 52 53 54 55 56 57 58 59
# 60 61 62 63 64 65 66 67 68 69
# 70 71 72 73 74 75 76 77 78 79
# 80 81 82 83 84 85 86 87 88 89
# 90 91 92 93 94 95 96 97 98 99
